Tekla.Structures.Model.ModelInfo
The ModelInfo class provides information about the currently open Tekla Structures
model.
When Tekla Structures is running the length of the model name tells you whether the model
is open.
using Tekla.Structures.Model;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Model CurrentModel = new Model();
ModelInfo Info = CurrentModel.GetInfo();
if (CurrentModel.GetConnectionStatus())
{
if (Info.ModelName.Length == 0)
{
MessageBox.Show("A Tekla Structures model is not open.");
}
}
}
}

Tekla.Structures.Model.ModelInfo.NorthDirection
The north direction of the current Tekla Structures model.

Tekla.Structures.Model.ModelInfo.ModelPath
The path to the Tekla Structures model.

Tekla.Structures.Model.ModelInfo.ModelName
The name of the Tekla Structures model.

Tekla.Structures.Model.ModelInfo.CurrentPhase
The number of the Tekla Structures model's current phase.

Tekla.Structures.Model.ModelInfo.SharedModel
The read-only property of the Tekla Structures model's sharing status.

Tekla.Structures.Model.ModelInfo.SingleUserModel
The read-only property if the Tekla Structures model is a single user model.

Tekla.Structures.Model.ModelInfo.#ctor
Creates a new ModelInfo instance without Tekla Structurea model name, path, or version information.

Tekla.Structures.Model.ModelInfo.GetInfo
Get current model info.